app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id]);
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    #render plain: params[:post]
    @post = Post.new(post_params)
    if (@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["body", "test"], ["created_at", "2018-03-16 02:01:17.467253"], ["updated_at", "2018-03-16 02:01:17.467253"]]

  def edit
    @post = Post.find(params[:id]);
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @post = Post.find(params[:id]);
    if (@post.update(post_params))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test test1"], ["body", "test test1"], ["updated_at", "2018-03-16 02:41:36.542099"], ["id", 1]]